#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details>
  <summary>Validation Output</summary>

  ```

  Success! The configuration is valid.


  ```

</details>

#### Terraform Plan 📖`success`

<details>
  <summary>Show Plan</summary>

  ```

  terraform
cloudflare_record.oldbigbuddhadev_txt_keybase: Refreshing state... [id=ad06bb7a06097273f4a03707624f8b71]
cloudflare_record.oldbigbuddhadev_txt_discord: Refreshing state... [id=9b88a27062c23df7c2a355a1dc3abb51]
cloudflare_record.oldbigbuddhanet_mx_root4: Refreshing state... [id=23579f1f7528a189e305e54eaf4d7e8e]
cloudflare_record.roppojsondev_a_root3: Refreshing state... [id=9967cf487501a2228f6820ef223a7c96]
cloudflare_record.oldbigbuddhadev_txt_root_openai: Refreshing state... [id=b74813888f04d8cc727452071243ee65]
cloudflare_record.oldbigbuddhanet_mx_root1: Refreshing state... [id=19b658250e60965e6e431cba8b28b838]
cloudflare_record.oldbigbuddhanet_cname_root: Refreshing state... [id=5d527e1ad96ef0c3dd0e64d8387c67e1]
cloudflare_record.oldbigbuddhadev_txt_root_spf: Refreshing state... [id=8c025269b0c25683c88dd3c352e4161d]
cloudflare_record.oldbigbuddhadev_mx_root1: Refreshing state... [id=837d0e880da0bb04feae611b26e7da29]
cloudflare_record.roppojsondev_a_root1: Refreshing state... [id=1afef8ec193641cbb4c48180888b2c69]
cloudflare_record.ojilabcloud_txt_root_googlesiteverification: Refreshing state... [id=d287e1bceb9844e362caffefcc302e0c]
cloudflare_record.oldbigbuddhanet_mx_root2: Refreshing state... [id=90407ffc481f9c7f4772fa1031d98979]
cloudflare_record.oldbigbuddhanet_mx_root5: Refreshing state... [id=45c71eba41caf9b7d4b880034f353a02]
cloudflare_record.oldbigbuddhadev_a_wp: Refreshing state... [id=c50d7bb0179b8ddb2192aea6bdd6349f]
cloudflare_record.oldbigbuddhadev_txt_dmarc: Refreshing state... [id=8cd213e2c5c82010a58e787fcaa17fa2]
cloudflare_record.roppojsondev_cname_api: Refreshing state... [id=762933d5414c910923416948c1472d65]
cloudflare_record.oldbigbuddhadev_txt_googledomainkey: Refreshing state... [id=4e34c312aaab56ceee8506db13088f5d]
cloudflare_record.oldbigbuddhadev_a_root: Refreshing state... [id=729bc4ba17a08bc95eaaac1eb98eeda4]
cloudflare_record.roppojsondev_a_root2: Refreshing state... [id=e2ae33112698aebc591a12a52a9b3759]
cloudflare_record.roppojsondev_txt_root_github_challenge: Refreshing state... [id=db0d8e71cfa6c02633ffe88270ac1689]
cloudflare_record.oldbigbuddhanet_txt_googledomainkey: Refreshing state... [id=9cc6202c5caf48a883219dfd10411739]
cloudflare_record.oldbigbuddhadev_cname_www: Refreshing state... [id=b25791d161fdcbcc6bfb30b3b3b76d1f]
cloudflare_record.oldbigbuddhadev_mx_root2: Refreshing state... [id=b41eaebef9ae6f583cf2eecbb9b92df9]
cloudflare_record.oldbigbuddhanet_mx_root3: Refreshing state... [id=7e83a273ed31c5bbe5fed969798e52ea]
cloudflare_record.oldbigbuddhadev_txt_atproto: Refreshing state... [id=708759efed68da7264a89b3bce88c1dd]
cloudflare_record.oldbigbuddhadev_mx_root5: Refreshing state... [id=61684a48eb4ee121aa515cd598b998b8]
cloudflare_record.oldbigbuddhadev_mx_root3: Refreshing state... [id=fb6db40c9f292324f2b12fd9d16ca982]
cloudflare_record.roppojsondev_a_root4: Refreshing state... [id=e5b705c2c09d6878a422af80ce990b00]
cloudflare_record.oldbigbuddhanet_txt_root_spf: Refreshing state... [id=32a246e34fdc70f5c0fa61d1ea30fd7e]
cloudflare_record.oldbigbuddhanet_txt_dmarc: Refreshing state... [id=0cfd90ff41ee1fe03a73773a8afb7272]
cloudflare_record.oldbigbuddhadev_txt_root_googlesiteverification: Refreshing state... [id=fbdabdb7d24c316c7eedae91bfc67186]
cloudflare_record.oldbigbuddhadev_a_sample: Refreshing state... [id=006013a1b3a01ea8f837b7a3e6e4396d]
cloudflare_record.oldbigbuddhadev_mx_root4: Refreshing state... [id=48dc2885839ba8899422a132c6c1f01c]
cloudflare_record.ojilabcloud_txt_access_demo: Refreshing state... [id=b6973f3066c3bee885f4a63848ed8ae0]
cloudflare_record.oldbigbuddhanet_txt_root_keybase: Refreshing state... [id=147204b239788f0b354ba270cae932b9]
cloudflare_record.record["f887b3adea226972affc939e06efab29.0"]: Refreshing state... [id=54e00588c994e9d4d8b834048ddc3483]
cloudflare_record.record["f887b3adea226972affc939e06efab29.2"]: Refreshing state... [id=5c150b0fee7e7dd89a811ed37144b936]
cloudflare_record.record["f887b3adea226972affc939e06efab29.1"]: Refreshing state... [id=8c9d207c65067164576e838625aaa953]
cloudflare_record.record["f887b3adea226972affc939e06efab29.4"]: Refreshing state... [id=b9fd1c6b3a86b4a79ef4341b5e34f29b]
cloudflare_record.record["f887b3adea226972affc939e06efab29.3"]: Refreshing state... [id=fabc8f7927b54fdae4c635ffc07ea8a2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # cloudflare_record.ojilabcloud_txt_access_demo will be destroyed
  # (because cloudflare_record.ojilabcloud_txt_access_demo is not in configuration)
  - resource "cloudflare_record" "ojilabcloud_txt_access_demo" {
      - created_on  = "2024-03-22T12:54:25.666616Z" -> null
      - hostname    = "_github-pages-challenge-oldbigbuddha.access-demo.ojilab.cloud" -> null
      - id          = "b6973f3066c3bee885f4a63848ed8ae0" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2024-03-22T12:54:25.666616Z" -> null
      - name        = "_github-pages-challenge-oldbigbuddha.access-demo" -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "c2844569820fc5a1fb0d4a67a700eb" -> null
      - zone_id     = "f887b3adea226972affc939e06efab29" -> null
    }

  # cloudflare_record.ojilabcloud_txt_root_googlesiteverification will be destroyed
  # (because cloudflare_record.ojilabcloud_txt_root_googlesiteverification is not in configuration)
  - resource "cloudflare_record" "ojilabcloud_txt_root_googlesiteverification" {
      - created_on  = "2022-03-11T00:53:20.202641Z" -> null
      - hostname    = "ojilab.cloud" -> null
      - id          = "d287e1bceb9844e362caffefcc302e0c" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2022-03-11T00:53:39.119855Z" -> null
      - name        = "ojilab.cloud" -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "google-site-verification=vrUCYxByqZoTy6Ad9LxX36pZ08uwlyf3BdjGkl2LOS0" -> null
      - zone_id     = "f887b3adea226972affc939e06efab29" -> null
    }

  # cloudflare_record.oldbigbuddhadev_a_root will be destroyed
  # (because cloudflare_record.oldbigbuddhadev_a_root is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhadev_a_root" {
      - created_on  = "2020-12-05T17:28:01.830619Z" -> null
      - hostname    = "oldbigbuddha.dev" -> null
      - id          = "729bc4ba17a08bc95eaaac1eb98eeda4" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2020-12-05T17:28:01.830619Z" -> null
      - name        = "oldbigbuddha.dev" -> null
      - proxiable   = true -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "A" -> null
      - value       = "76.76.21.21" -> null
      - zone_id     = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.oldbigbuddhadev_a_sample will be destroyed
  # (because cloudflare_record.oldbigbuddhadev_a_sample is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhadev_a_sample" {
      - created_on  = "2020-12-17T05:25:34.736171Z" -> null
      - hostname    = "sample.oldbigbuddha.dev" -> null
      - id          = "006013a1b3a01ea8f837b7a3e6e4396d" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2020-12-17T05:25:34.736171Z" -> null
      - name        = "sample" -> null
      - proxiable   = true -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "CNAME" -> null
      - value       = "oldbigbuddha-sample.netlify.app" -> null
      - zone_id     = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.oldbigbuddhadev_a_wp will be destroyed
  # (because cloudflare_record.oldbigbuddhadev_a_wp is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhadev_a_wp" {
      - created_on  = "2022-03-24T10:30:27.957793Z" -> null
      - hostname    = "wp.oldbigbuddha.dev" -> null
      - id          = "c50d7bb0179b8ddb2192aea6bdd6349f" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2022-03-24T10:31:43.72933Z" -> null
      - name        = "wp" -> null
      - proxiable   = true -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "A" -> null
      - value       = "49.212.175.115" -> null
      - zone_id     = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.oldbigbuddhadev_cname_www will be destroyed
  # (because cloudflare_record.oldbigbuddhadev_cname_www is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhadev_cname_www" {
      - created_on  = "2020-12-05T17:28:17.527198Z" -> null
      - hostname    = "www.oldbigbuddha.dev" -> null
      - id          = "b25791d161fdcbcc6bfb30b3b3b76d1f" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2020-12-05T17:28:17.527198Z" -> null
      - name        = "www" -> null
      - proxiable   = true -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "CNAME" -> null
      - value       = "oldbigbuddha.dev" -> null
      - zone_id     = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.oldbigbuddhadev_mx_root1 will be destroyed
  # (because cloudflare_record.oldbigbuddhadev_mx_root1 is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhadev_mx_root1" {
      - created_on  = "2019-04-17T19:20:21.323802Z" -> null
      - hostname    = "oldbigbuddha.dev" -> null
      - id          = "837d0e880da0bb04feae611b26e7da29" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-04-17T19:20:21.323802Z" -> null
      - name        = "oldbigbuddha.dev" -> null
      - priority    = 10 -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "MX" -> null
      - value       = "aspmx3.googlemail.com" -> null
      - zone_id     = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.oldbigbuddhadev_mx_root2 will be destroyed
  # (because cloudflare_record.oldbigbuddhadev_mx_root2 is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhadev_mx_root2" {
      - created_on  = "2019-04-17T19:20:11.750917Z" -> null
      - hostname    = "oldbigbuddha.dev" -> null
      - id          = "b41eaebef9ae6f583cf2eecbb9b92df9" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-04-17T19:20:11.750917Z" -> null
      - name        = "oldbigbuddha.dev" -> null
      - priority    = 10 -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "MX" -> null
      - value       = "aspmx2.googlemail.com" -> null
      - zone_id     = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.oldbigbuddhadev_mx_root3 will be destroyed
  # (because cloudflare_record.oldbigbuddhadev_mx_root3 is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhadev_mx_root3" {
      - created_on  = "2019-04-17T19:19:46.424183Z" -> null
      - hostname    = "oldbigbuddha.dev" -> null
      - id          = "fb6db40c9f292324f2b12fd9d16ca982" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-04-17T19:19:46.424183Z" -> null
      - name        = "oldbigbuddha.dev" -> null
      - priority    = 5 -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "MX" -> null
      - value       = "alt2.aspmx.l.google.com" -> null
      - zone_id     = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.oldbigbuddhadev_mx_root4 will be destroyed
  # (because cloudflare_record.oldbigbuddhadev_mx_root4 is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhadev_mx_root4" {
      - created_on  = "2019-04-17T19:19:27.034075Z" -> null
      - hostname    = "oldbigbuddha.dev" -> null
      - id          = "48dc2885839ba8899422a132c6c1f01c" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-04-17T19:19:27.034075Z" -> null
      - name        = "oldbigbuddha.dev" -> null
      - priority    = 5 -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "MX" -> null
      - value       = "alt1.aspmx.l.google.com" -> null
      - zone_id     = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.oldbigbuddhadev_mx_root5 will be destroyed
  # (because cloudflare_record.oldbigbuddhadev_mx_root5 is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhadev_mx_root5" {
      - created_on  = "2019-04-17T19:19:05.787079Z" -> null
      - hostname    = "oldbigbuddha.dev" -> null
      - id          = "61684a48eb4ee121aa515cd598b998b8" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-04-17T19:19:05.787079Z" -> null
      - name        = "oldbigbuddha.dev" -> null
      - priority    = 1 -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "MX" -> null
      - value       = "aspmx.l.google.com" -> null
      - zone_id     = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.oldbigbuddhadev_txt_atproto will be destroyed
  # (because cloudflare_record.oldbigbuddhadev_txt_atproto is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhadev_txt_atproto" {
      - comment     = "AT Protocol" -> null
      - created_on  = "2023-07-01T23:54:25.347857Z" -> null
      - hostname    = "_atproto.oldbigbuddha.dev" -> null
      - id          = "708759efed68da7264a89b3bce88c1dd" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2023-07-01T23:54:25.347857Z" -> null
      - name        = "_atproto" -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 86400 -> null
      - type        = "TXT" -> null
      - value       = "did=did:plc:5qggovenhhspe74jcnygnxsr" -> null
      - zone_id     = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.oldbigbuddhadev_txt_discord will be destroyed
  # (because cloudflare_record.oldbigbuddhadev_txt_discord is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhadev_txt_discord" {
      - created_on  = "2024-02-24T02:43:04.804139Z" -> null
      - hostname    = "_discord.oldbigbuddha.dev" -> null
      - id          = "9b88a27062c23df7c2a355a1dc3abb51" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2024-02-24T02:43:04.804139Z" -> null
      - name        = "_discord" -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "dh=fc30d3d8be43cbae588075a516f13a2c7ee55e6c" -> null
      - zone_id     = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.oldbigbuddhadev_txt_dmarc will be destroyed
  # (because cloudflare_record.oldbigbuddhadev_txt_dmarc is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhadev_txt_dmarc" {
      - created_on  = "2019-06-25T12:11:17.386245Z" -> null
      - hostname    = "_dmarc.oldbigbuddha.dev" -> null
      - id          = "8cd213e2c5c82010a58e787fcaa17fa2" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-06-25T12:11:17.386245Z" -> null
      - name        = "_dmarc" -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "v=DMARC1; p=quarantine; pct=100; rua=mailto:abuse@oldbigbuddha.dev; aspf=s" -> null
      - zone_id     = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.oldbigbuddhadev_txt_googledomainkey will be destroyed
  # (because cloudflare_record.oldbigbuddhadev_txt_googledomainkey is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhadev_txt_googledomainkey" {
      - created_on  = "2019-05-12T19:40:28.706187Z" -> null
      - hostname    = "google._domainkey.oldbigbuddha.dev" -> null
      - id          = "4e34c312aaab56ceee8506db13088f5d" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-05-12T19:40:28.706187Z" -> null
      - name        = "google._domainkey" -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "v=DKIM1; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEArrysCaKuRdl0yOcag/gKceC35XG7Z16P5N1nQ3ZkS5JqOr215KcJx1Z6PCISKJqD+j0+mzyuxupR4+60Tq9kFEbqLt6vIGSZe0MX3dJXMAGW/Nz/bz2SdPn5jb5dy5vBij5Js+TL1mkWJJSN7EAV4wLd3hNJLNFVbM4KC53lhDSCbo6lAlRzV46wrVwip4fERM4p9C4Kft4BObfWMYGrlRShEJTY/RYakxm7q8DZo2yIRnJSL1kb3pKrvjDRGWwo8PR1tvOQdUfLQ7R6RAjud+K8A/9eROmKXU/96l5I2SEUR6vqcM0XZZllSVkqh1nODdCKJZwKfe/vBoIJzrEh7wIDAQAB" -> null
      - zone_id     = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.oldbigbuddhadev_txt_keybase will be destroyed
  # (because cloudflare_record.oldbigbuddhadev_txt_keybase is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhadev_txt_keybase" {
      - created_on  = "2019-04-24T05:36:29.898005Z" -> null
      - hostname    = "_keybase.oldbigbuddha.dev" -> null
      - id          = "ad06bb7a06097273f4a03707624f8b71" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-04-24T05:36:29.898005Z" -> null
      - name        = "_keybase" -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "keybase-site-verification=x6O4-tjJZYjjGBqo2ETLsRcWSssKT4oFzqZ8o7qomsQ" -> null
      - zone_id     = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.oldbigbuddhadev_txt_root_googlesiteverification will be destroyed
  # (because cloudflare_record.oldbigbuddhadev_txt_root_googlesiteverification is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhadev_txt_root_googlesiteverification" {
      - created_on  = "2019-04-17T19:17:33.621037Z" -> null
      - hostname    = "oldbigbuddha.dev" -> null
      - id          = "fbdabdb7d24c316c7eedae91bfc67186" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-04-17T19:17:33.621037Z" -> null
      - name        = "oldbigbuddha.dev" -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "google-site-verification=mkuH-GziO_LEwhNkcUYDGX-Nd9SfdRhkwsnOeFWDJuM" -> null
      - zone_id     = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.oldbigbuddhadev_txt_root_openai will be destroyed
  # (because cloudflare_record.oldbigbuddhadev_txt_root_openai is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhadev_txt_root_openai" {
      - created_on  = "2023-12-17T15:28:22.594502Z" -> null
      - hostname    = "oldbigbuddha.dev" -> null
      - id          = "b74813888f04d8cc727452071243ee65" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2023-12-17T15:29:53.127349Z" -> null
      - name        = "oldbigbuddha.dev" -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "openai-domain-verification=dv-3wTUxEgEdL7mE4cwQURCV5sJ" -> null
      - zone_id     = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.oldbigbuddhadev_txt_root_spf will be destroyed
  # (because cloudflare_record.oldbigbuddhadev_txt_root_spf is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhadev_txt_root_spf" {
      - created_on  = "2019-05-12T19:38:24.612724Z" -> null
      - hostname    = "oldbigbuddha.dev" -> null
      - id          = "8c025269b0c25683c88dd3c352e4161d" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-05-12T19:38:24.612724Z" -> null
      - name        = "oldbigbuddha.dev" -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "v=spf1 include:_spf.google.com ~all" -> null
      - zone_id     = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.oldbigbuddhanet_cname_root will be destroyed
  # (because cloudflare_record.oldbigbuddhanet_cname_root is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhanet_cname_root" {
      - created_on  = "2020-12-06T05:09:33.385308Z" -> null
      - hostname    = "oldbigbuddha.net" -> null
      - id          = "5d527e1ad96ef0c3dd0e64d8387c67e1" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2020-12-06T05:09:33.385308Z" -> null
      - name        = "oldbigbuddha.net" -> null
      - proxiable   = true -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "CNAME" -> null
      - value       = "oldbigbuddha.dev" -> null
      - zone_id     = "483ae9ae0485ed8fd56158fb9309d648" -> null
    }

  # cloudflare_record.oldbigbuddhanet_mx_root1 will be destroyed
  # (because cloudflare_record.oldbigbuddhanet_mx_root1 is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhanet_mx_root1" {
      - created_on  = "2018-06-02T04:01:24.916107Z" -> null
      - hostname    = "oldbigbuddha.net" -> null
      - id          = "19b658250e60965e6e431cba8b28b838" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2018-06-02T04:01:24.916107Z" -> null
      - name        = "oldbigbuddha.net" -> null
      - priority    = 10 -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "MX" -> null
      - value       = "alt4.aspmx.l.google.com" -> null
      - zone_id     = "483ae9ae0485ed8fd56158fb9309d648" -> null
    }

  # cloudflare_record.oldbigbuddhanet_mx_root2 will be destroyed
  # (because cloudflare_record.oldbigbuddhanet_mx_root2 is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhanet_mx_root2" {
      - created_on  = "2018-06-02T04:01:10.483441Z" -> null
      - hostname    = "oldbigbuddha.net" -> null
      - id          = "90407ffc481f9c7f4772fa1031d98979" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2018-06-02T04:01:10.483441Z" -> null
      - name        = "oldbigbuddha.net" -> null
      - priority    = 10 -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "MX" -> null
      - value       = "alt3.aspmx.l.google.com" -> null
      - zone_id     = "483ae9ae0485ed8fd56158fb9309d648" -> null
    }

  # cloudflare_record.oldbigbuddhanet_mx_root3 will be destroyed
  # (because cloudflare_record.oldbigbuddhanet_mx_root3 is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhanet_mx_root3" {
      - created_on  = "2018-06-02T04:00:55.772082Z" -> null
      - hostname    = "oldbigbuddha.net" -> null
      - id          = "7e83a273ed31c5bbe5fed969798e52ea" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2018-06-02T04:00:55.772082Z" -> null
      - name        = "oldbigbuddha.net" -> null
      - priority    = 5 -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "MX" -> null
      - value       = "alt2.aspmx.l.google.com" -> null
      - zone_id     = "483ae9ae0485ed8fd56158fb9309d648" -> null
    }

  # cloudflare_record.oldbigbuddhanet_mx_root4 will be destroyed
  # (because cloudflare_record.oldbigbuddhanet_mx_root4 is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhanet_mx_root4" {
      - created_on  = "2018-06-02T04:00:40.31836Z" -> null
      - hostname    = "oldbigbuddha.net" -> null
      - id          = "23579f1f7528a189e305e54eaf4d7e8e" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2018-06-02T04:00:40.31836Z" -> null
      - name        = "oldbigbuddha.net" -> null
      - priority    = 5 -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "MX" -> null
      - value       = "alt1.aspmx.l.google.com" -> null
      - zone_id     = "483ae9ae0485ed8fd56158fb9309d648" -> null
    }

  # cloudflare_record.oldbigbuddhanet_mx_root5 will be destroyed
  # (because cloudflare_record.oldbigbuddhanet_mx_root5 is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhanet_mx_root5" {
      - created_on  = "2018-06-02T04:00:25.028023Z" -> null
      - hostname    = "oldbigbuddha.net" -> null
      - id          = "45c71eba41caf9b7d4b880034f353a02" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2018-06-02T04:00:25.028023Z" -> null
      - name        = "oldbigbuddha.net" -> null
      - priority    = 1 -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "MX" -> null
      - value       = "aspmx.l.google.com" -> null
      - zone_id     = "483ae9ae0485ed8fd56158fb9309d648" -> null
    }

  # cloudflare_record.oldbigbuddhanet_txt_dmarc will be destroyed
  # (because cloudflare_record.oldbigbuddhanet_txt_dmarc is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhanet_txt_dmarc" {
      - created_on  = "2019-06-25T12:08:47.499863Z" -> null
      - hostname    = "_dmarc.oldbigbuddha.net" -> null
      - id          = "0cfd90ff41ee1fe03a73773a8afb7272" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-06-25T12:08:47.499863Z" -> null
      - name        = "_dmarc" -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "v=DMARC1; p=quarantine; pct=100; rua=mailto:abuse@oldbigbuddha.net; aspf=s" -> null
      - zone_id     = "483ae9ae0485ed8fd56158fb9309d648" -> null
    }

  # cloudflare_record.oldbigbuddhanet_txt_googledomainkey will be destroyed
  # (because cloudflare_record.oldbigbuddhanet_txt_googledomainkey is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhanet_txt_googledomainkey" {
      - created_on  = "2019-05-11T10:10:26.637286Z" -> null
      - hostname    = "google._domainkey.oldbigbuddha.net" -> null
      - id          = "9cc6202c5caf48a883219dfd10411739" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-05-11T10:10:26.637286Z" -> null
      - name        = "google._domainkey" -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "v=DKIM1; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAqOyjJhcyOtHHtLIz22K5IxzuO1vDWqLZaJqwYn6q4vwrb5pg3bXWJ9OLQjLUlkZodINjDNNVHDfNx3ZSzqE9VSMvuYSUWNJ27jhS5QpjaBzEJiY62UlyytXWDQtXrJAlpiVwGYNYFTboQ6mx27MaHXDod7rZ3Xdt10FMIH74k2YmUTt9GamJ0h4+KRv1nr9FMPoxHpkdvH5wcwpvusbZwCMurOV/9R+z9v42JCKCrOp+ZIU7Dnu3gceVb+HbKWSuHUxKuTUBLp/SASdAUtmOvMcTRfmA9ge0+NKdZQwhoAh246QVwZ2OFmrR5gk3qYIDHgKCm9d715oxbcHxifGt6wIDAQAB" -> null
      - zone_id     = "483ae9ae0485ed8fd56158fb9309d648" -> null
    }

  # cloudflare_record.oldbigbuddhanet_txt_root_keybase will be destroyed
  # (because cloudflare_record.oldbigbuddhanet_txt_root_keybase is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhanet_txt_root_keybase" {
      - created_on  = "2019-04-01T15:59:01.679293Z" -> null
      - hostname    = "oldbigbuddha.net" -> null
      - id          = "147204b239788f0b354ba270cae932b9" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-04-01T15:59:01.679293Z" -> null
      - name        = "oldbigbuddha.net" -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "keybase-site-verification=lCspfXMW8Na3T6EHnSE3Fun3l4Je28Y_5jGjzJ4XvQU" -> null
      - zone_id     = "483ae9ae0485ed8fd56158fb9309d648" -> null
    }

  # cloudflare_record.oldbigbuddhanet_txt_root_spf will be destroyed
  # (because cloudflare_record.oldbigbuddhanet_txt_root_spf is not in configuration)
  - resource "cloudflare_record" "oldbigbuddhanet_txt_root_spf" {
      - created_on  = "2019-05-11T10:16:10.804663Z" -> null
      - hostname    = "oldbigbuddha.net" -> null
      - id          = "32a246e34fdc70f5c0fa61d1ea30fd7e" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-05-11T10:16:10.804663Z" -> null
      - name        = "oldbigbuddha.net" -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "v=spf1 include:_spf.google.com ~all" -> null
      - zone_id     = "483ae9ae0485ed8fd56158fb9309d648" -> null
    }

  # cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.0"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.net"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "CNAME"
      + value           = "oldbigbuddha.dev"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.1"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.net"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "alt4.aspmx.l.google.com"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.2"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.net"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "alt3.aspmx.l.google.com"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.3"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.net"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "alt2.aspmx.l.google.com"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.4"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.net"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "alt1.aspmx.l.google.com"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.5"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.net"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "aspmx.l.google.com"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.6"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DMARC1; p=quarantine; pct=100; rua=mailto:abuse@oldbigbuddha.net; aspf=s"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.7"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "google._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DKIM1; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAqOyjJhcyOtHHtLIz22K5IxzuO1vDWqLZaJqwYn6q4vwrb5pg3bXWJ9OLQjLUlkZodINjDNNVHDfNx3ZSzqE9VSMvuYSUWNJ27jhS5QpjaBzEJiY62UlyytXWDQtXrJAlpiVwGYNYFTboQ6mx27MaHXDod7rZ3Xdt10FMIH74k2YmUTt9GamJ0h4+KRv1nr9FMPoxHpkdvH5wcwpvusbZwCMurOV/9R+z9v42JCKCrOp+ZIU7Dnu3gceVb+HbKWSuHUxKuTUBLp/SASdAUtmOvMcTRfmA9ge0+NKdZQwhoAh246QVwZ2OFmrR5gk3qYIDHgKCm9d715oxbcHxifGt6wIDAQAB"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.8"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.net"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=spf1 include:_spf.google.com ~all"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.9"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.net"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "keybase-site-verification=lCspfXMW8Na3T6EHnSE3Fun3l4Je28Y_5jGjzJ4XvQU"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.0"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "roppo-json.dev"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "185.199.111.153"
      + zone_id         = "66117ce3d2f787b55de4e5aa859ffceb"
    }

  # cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.1"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "roppo-json.dev"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "185.199.110.153"
      + zone_id         = "66117ce3d2f787b55de4e5aa859ffceb"
    }

  # cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.2"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "roppo-json.dev"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "185.199.108.153"
      + zone_id         = "66117ce3d2f787b55de4e5aa859ffceb"
    }

  # cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.3"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "roppo-json.dev"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "185.199.109.153"
      + zone_id         = "66117ce3d2f787b55de4e5aa859ffceb"
    }

  # cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.4"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "terrestrial-gazelle-ijjn6zwnr5j3rtnvyufwyi0s.herokudns.com"
      + zone_id         = "66117ce3d2f787b55de4e5aa859ffceb"
    }

  # cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.5"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_github-challenge-roppo-json"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "f0a59e5fc7"
      + zone_id         = "66117ce3d2f787b55de4e5aa859ffceb"
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.0"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "A"
      + value           = "76.76.21.21"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.1"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "wp"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "A"
      + value           = "49.212.175.115"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.10"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_discord"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "dh=fc30d3d8be43cbae588075a516f13a2c7ee55e6c"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.11"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DMARC1; p=quarantine; pct=100; rua=mailto:abuse@oldbigbuddha.dev; aspf=s"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.12"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "google._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DKIM1; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEArrysCaKuRdl0yOcag/gKceC35XG7Z16P5N1nQ3ZkS5JqOr215KcJx1Z6PCISKJqD+j0+mzyuxupR4+60Tq9kFEbqLt6vIGSZe0MX3dJXMAGW/Nz/bz2SdPn5jb5dy5vBij5Js+TL1mkWJJSN7EAV4wLd3hNJLNFVbM4KC53lhDSCbo6lAlRzV46wrVwip4fERM4p9C4Kft4BObfWMYGrlRShEJTY/RYakxm7q8DZo2yIRnJSL1kb3pKrvjDRGWwo8PR1tvOQdUfLQ7R6RAjud+K8A/9eROmKXU/96l5I2SEUR6vqcM0XZZllSVkqh1nODdCKJZwKfe/vBoIJzrEh7wIDAQAB"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.13"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_keybase"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "keybase-site-verification=x6O4-tjJZYjjGBqo2ETLsRcWSssKT4oFzqZ8o7qomsQ"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.14"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "openai-domain-verification=dv-3wTUxEgEdL7mE4cwQURCV5sJ"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.15"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=spf1 include:_spf.google.com ~all"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.16"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "google-site-verification=mkuH-GziO_LEwhNkcUYDGX-Nd9SfdRhkwsnOeFWDJuM"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.2"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "sample"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "CNAME"
      + value           = "oldbigbuddha-sample.netlify.app"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.3"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "CNAME"
      + value           = "oldbigbuddha.dev"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.4"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "aspmx3.googlemail.com"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.5"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "aspmx2.googlemail.com"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.6"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "alt2.aspmx.l.google.com"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.7"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "alt1.aspmx.l.google.com"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.8"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "aspmx.l.google.com"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.9"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_atproto"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 86400
      + type            = "TXT"
      + value           = "did=did:plc:5qggovenhhspe74jcnygnxsr"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.record["f887b3adea226972affc939e06efab29.5"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_github-pages-challenge-oldbigbuddha.access-demo"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "c2844569820fc5a1fb0d4a67a700eb"
      + zone_id         = "f887b3adea226972affc939e06efab29"
    }

  # cloudflare_record.record["f887b3adea226972affc939e06efab29.6"] will be created
  + resource "cloudflare_record" "record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ojilab.cloud"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "google-site-verification=vrUCYxByqZoTy6Ad9LxX36pZ08uwlyf3BdjGkl2LOS0"
      + zone_id         = "f887b3adea226972affc939e06efab29"
    }

  # cloudflare_record.roppojsondev_a_root1 will be destroyed
  # (because cloudflare_record.roppojsondev_a_root1 is not in configuration)
  - resource "cloudflare_record" "roppojsondev_a_root1" {
      - created_on  = "2019-11-08T10:34:40.936665Z" -> null
      - hostname    = "roppo-json.dev" -> null
      - id          = "1afef8ec193641cbb4c48180888b2c69" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-11-08T10:34:40.936665Z" -> null
      - name        = "roppo-json.dev" -> null
      - proxiable   = true -> null
      - proxied     = true -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "A" -> null
      - value       = "185.199.111.153" -> null
      - zone_id     = "66117ce3d2f787b55de4e5aa859ffceb" -> null
    }

  # cloudflare_record.roppojsondev_a_root2 will be destroyed
  # (because cloudflare_record.roppojsondev_a_root2 is not in configuration)
  - resource "cloudflare_record" "roppojsondev_a_root2" {
      - created_on  = "2019-11-08T10:33:59.910746Z" -> null
      - hostname    = "roppo-json.dev" -> null
      - id          = "e2ae33112698aebc591a12a52a9b3759" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-11-08T10:33:59.910746Z" -> null
      - name        = "roppo-json.dev" -> null
      - proxiable   = true -> null
      - proxied     = true -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "A" -> null
      - value       = "185.199.110.153" -> null
      - zone_id     = "66117ce3d2f787b55de4e5aa859ffceb" -> null
    }

  # cloudflare_record.roppojsondev_a_root3 will be destroyed
  # (because cloudflare_record.roppojsondev_a_root3 is not in configuration)
  - resource "cloudflare_record" "roppojsondev_a_root3" {
      - created_on  = "2019-11-08T10:33:38.811089Z" -> null
      - hostname    = "roppo-json.dev" -> null
      - id          = "9967cf487501a2228f6820ef223a7c96" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-11-08T10:33:38.811089Z" -> null
      - name        = "roppo-json.dev" -> null
      - proxiable   = true -> null
      - proxied     = true -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "A" -> null
      - value       = "185.199.108.153" -> null
      - zone_id     = "66117ce3d2f787b55de4e5aa859ffceb" -> null
    }

  # cloudflare_record.roppojsondev_a_root4 will be destroyed
  # (because cloudflare_record.roppojsondev_a_root4 is not in configuration)
  - resource "cloudflare_record" "roppojsondev_a_root4" {
      - created_on  = "2019-11-08T10:33:38.144987Z" -> null
      - hostname    = "roppo-json.dev" -> null
      - id          = "e5b705c2c09d6878a422af80ce990b00" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-11-08T10:33:38.144987Z" -> null
      - name        = "roppo-json.dev" -> null
      - proxiable   = true -> null
      - proxied     = true -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "A" -> null
      - value       = "185.199.109.153" -> null
      - zone_id     = "66117ce3d2f787b55de4e5aa859ffceb" -> null
    }

  # cloudflare_record.roppojsondev_cname_api will be destroyed
  # (because cloudflare_record.roppojsondev_cname_api is not in configuration)
  - resource "cloudflare_record" "roppojsondev_cname_api" {
      - created_on  = "2019-11-08T09:27:36.972904Z" -> null
      - hostname    = "api.roppo-json.dev" -> null
      - id          = "762933d5414c910923416948c1472d65" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-11-08T09:27:36.972904Z" -> null
      - name        = "api" -> null
      - proxiable   = true -> null
      - proxied     = true -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "CNAME" -> null
      - value       = "terrestrial-gazelle-ijjn6zwnr5j3rtnvyufwyi0s.herokudns.com" -> null
      - zone_id     = "66117ce3d2f787b55de4e5aa859ffceb" -> null
    }

  # cloudflare_record.roppojsondev_txt_root_github_challenge will be destroyed
  # (because cloudflare_record.roppojsondev_txt_root_github_challenge is not in configuration)
  - resource "cloudflare_record" "roppojsondev_txt_root_github_challenge" {
      - created_on  = "2019-11-09T02:17:27.874849Z" -> null
      - hostname    = "_github-challenge-roppo-json.roppo-json.dev" -> null
      - id          = "db0d8e71cfa6c02633ffe88270ac1689" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-11-09T02:17:27.874849Z" -> null
      - name        = "_github-challenge-roppo-json" -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "f0a59e5fc7" -> null
      - zone_id     = "66117ce3d2f787b55de4e5aa859ffceb" -> null
    }

Plan: 35 to add, 0 to change, 35 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```

</details>
*Pusher: @OldBigBuddha, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*